[
  {
    "slug": "unity-senior-engineer-timisoara",
    "name": "Unity Engineer",
    "location": "Timișoara",
    "allocation": "Full-Time",
    "title": "Senior",
    "description": "QED is looking to incorporate an experienced Sr. Unity Developer to work on Sandbox's blockchain based gaming platform. The Sandbox is building a decentralized metaverse, empowering creators and players to come together and build the world they’ve always wanted. It is their mission to build an inclusive and open metaverse, building the bridge between blockchain, social experiences, and gaming, creating long-lasting relationships through the power of community, creativity, and NFTs. To learn more, check them out at www.sandbox.game or on Twitter at @TheSandboxGame.",
    "responsibilities": [
      "Participate in our product development from ideation to deployment and beyond.",
      "Write well designed, testable, efficient code by using best software development practices.",
      "Translate design and product documentation into technical specifications.",
      "Create authoring and/or debugging tools.",
      "Build reusable code and libraries for future use.",
      "Create groundbreaking new features for our users and for internal use."
    ],
    "requirements": [
      "Degree in computer science/information technology or relevant professional experience.",
      "At least 2 years of experience in using Unity and more than 3 years in game development.",
      "Shipped at least one Unity game.",
      "C++/C# programming experience.",
      "Deep understanding of data structures, 3D math and Data Oriented mindset.",
      "Deep understanding of Unity asset and build pipeline.",
      "Knowledge of Unity team project best-practices (prefabs, asset naming, organized scene hierarchy)",
      "Experience with Git or other DVCS.",
      "Able to work in a collaborative and distributed development environment with excellent time-management, organization, and communication skills.",
      "Experience with Unity new Data Oriented Technology Stack (DOTS)."
    ],
    "plus": [
      "Experience with Unity new Data Oriented Technology Stack (DOTS).",
      "Experience with Unity new Scripted Render Pipeline.",
      "Experience developing and optimizing for mobile devices (iOS, Android).",
      "Advanced rendering/Shaders."
    ]
  },
  {
    "slug": "backend-senior-engineer-timisoara",
    "name": "Backend Engineer",
    "location": "Timișoara",
    "allocation": "Full-Time",
    "title": "Senior",
    "description": "QED is looking for a experienced Backend Engineers to help revolutionize the way we create, play, and share gameplay on Sandbox's blockchain decentralized metaverse.The Sandbox is building a decentralized metaverse, empowering creators and players to come together and build the world they’ve always wanted. It is their mission to build an inclusive and open metaverse, building the bridge between blockchain, social experiences, and gaming, creating long-lasting relationships through the power of community, creativity, and NFTs. To learn more, check them out at www.sandbox.game or on Twitter at @TheSandboxGame.",
    "responsibilities": [
      "Participate in our product development from ideation to deployment and beyond.",
      "Write well designed, testable, efficient code by using best software development practices.",
      "Design and develop API's (for Web, Mobile and PC clients).",
      "Design and implementation of data storage solutions.",
      "Integrate and consume other services/API's.",
      "Maintain and help optimize existing systems.",
      "Build reusable code and libraries for future use.",
      "Create groundbreaking new features for our users and for internal use." 
    ],
    "requirements": [
      "Minimum +5 years of working experience in similar position.",
      "Top-notch programming skills.",
      "Proficient knowledge of a back-end programming language (preferably Javascript, we use Node.js in our backend).",
      "Experience working with SQL/NoSQL databases (preferably MySQL and Redis).",
      "Version control with Git.",
      "A solid understanding of how web applications work including security, session management, and best development practices.",
      "Experience in AWS & Docker.",
      "Strong organizational skills to juggle multiple tasks within the constraints of timelines."
    ]
  },
  {
    "slug": "frontend-senior-engineer-timisoara",
    "name": "Frontend Engineer",
    "location": "Timișoara",
    "allocation": "Full-Time",
    "title": "Senior",
    "description": "QED is looking to incorporate an experienced SR Web Frontend Developer to work on Sandbox's blockchain based gaming platform. The Sandbox is building a decentralized metaverse, empowering creators and players to come together and build the world they’ve always wanted. It is their mission to build an inclusive and open metaverse, building the bridge between blockchain, social experiences, and gaming, creating long-lasting relationships through the power of community, creativity, and NFTs. To learn more, check them out at www.sandbox.game or on Twitter at @TheSandboxGame.",
    "responsibilities": [
      "Writing well designed, testable, efficient code by using best software development practices.",
      "Creating website layout/user interfaces by using standard HTML/CSS practices.",
      "Cooperate with web designers to match visual design intent.",
      "Bring to life web pages based on Artists Photoshop mockups, up to pixelperfect.",
      "Maintain and help optimize existing systems."
    ],
    "requirements": [
      "Minimum +5 years of working experience in similar position.",
      "Top-notch programming skills.",
      "Proficient in any programming language, preferably Javascript (we use Node.js here)",
      "You know your way around HTML and CSS.",
      "Knowledge of any modern JS based frontend frameworks.",
      "Experience working with SQL/No-SQL databases (preferably MySQL and Redis).",
      "Version control with Git.",
      "A solid understanding of how web applications work including security, session management, and best development practices.",
      "Experience in AWS, Digital Ocean or other clouds.",
      "Experience with Docker."
    ]
  },
  {
    "slug": "qa-lead-timisoara",
    "name": "QA Lead",
    "location": "Timișoara",
    "allocation": "Full-Time",
    "title": "Senior",
    "description": "QED is looking to incorporate an experienced SR QA Tester to work on Sandbox's blockchain based gaming platform. The Sandbox is building a decentralized metaverse, empowering creators and players to come together and build the world they’ve always wanted. It is their mission to build an inclusive and open metaverse, building the bridge between blockchain, social experiences, and gaming, creating long-lasting relationships through the power of community, creativity, and NFTs. To learn more, check them out at www.sandbox.game or on Twitter at @TheSandboxGame."
    "responsibilities": [
      "The QA Tester will have the responsibility to ensure that the development team will provide the most stable and functional builds and/or releases across all products of The Sandbox platform, following the highest quality standards within the industry – as well as constantly improving the overall quality of the project and the processes."
      "Write and update test cases and test plans.",
      "Complete daily smoke tests in a timely manner.",
      "Quickly run through the whole product to check the stability of a build.",
      "Enter clear and concise tickets into the bug tracking database (JIRA or similar).",
      "Identify defects, follow test plans, reproduce and check fixes from programmers and designers.",
      "Collaborate with developers, Level Designers and Game Designers in identifying, investigating and reporting issues.",
      "Provide feedback to improve the products, UX and flows.",
      "Work closely with other QA members and teams."
    ],
    "requirements": [
      "3+ years’ experience in a QA position.",
      "Previous web testing and video game testing experience.",
      "Comfortable using PC Windows.",
      "Fluent in English, especially written communication skills.",
      "Ability to give optimization feedback about the current games.",
      "Reliable with the ability to work in a team environment.",
      "Pro-activity will be appreciated.",
      "Knowledge about the crypto world is a plus."
    ],
    "plus": [
      "QA Automation experience",
      "Cucumber/Gherkin experience",
      "Performance testing experience"
    ]
  }
]
